In [6]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

#df.head(100)

age_column = df['age']
print (age_column)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [7]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

df['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
print("--- A Single Column (a Series) ---")
print(df.age.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [14]:
subset = df[['pclass', 'sex', 'age']]
print("\n--- Multiple Columns (a DataFrame) ---")
print(subset.head())

--- Multiple Columns (a DataFrame) ---
   pclass     sex   age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0
4       3    male  35.0

In [15]:
row_0 = df.loc[0]
print("A single row (also a Series)")
print(row_0.head())

A single row (also a Series)
survived       0
pclass         3
sex         male
age         22.0
sibsp          1
Name: 0, dtype: object

In [16]:
first_5_rows = df.loc[0:4]
print(first_5_rows)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [21]:
first_5_columns_and_rows = df.loc[0:4,['age','fare']]
print(first_5_columns_and_rows)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [22]:
first_5_columns_and_rows2 = df.loc[0:5,['age','fare']]
print(first_5_columns_and_rows2)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583

In [23]:
df_exercise = df.loc[10:15,['sex','survived']]
print(df_exercise)

       sex  survived
10  female         1
11  female         1
12    male         0
13    male         0
14  female         0
15  female         1

In [26]:
condition = (df['sex'] == 'female')

females = df.loc[condition]

print(females)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
8           1       3  female  27.0      0      2  11.1333        S   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
880         1       2  female  25.0      0      1  26.0000        S  Second
882         0       3  female  22.0      0      0  10.5167        S   Third
885         0       3  female  39.0      0      5  29.1250        Q   Third
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
880  woman       False  NaN  Southampton   yes  False
882  woman       False  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False

[314 rows x 15 columns]

In [32]:
cond_2 = (df['age'] > 30)
und30 = df.loc[cond_2]
print(cond_2)

0      False
1       True
2      False
3       True
4       True
       ...
886    False
887    False
888    False
889    False
890     True
Name: age, Length: 891, dtype: bool

In [34]:
undi30 = df.loc[df['age'] > 30]
print(undi30)

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1           1       1  female  38.0      1      0  71.2833        C  First
3           1       1  female  35.0      1      0  53.1000        S  First
4           0       3    male  35.0      0      0   8.0500        S  Third
6           0       1    male  54.0      0      0  51.8625        S  First
11          1       1  female  58.0      0      0  26.5500        S  First
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
873         0       3    male  47.0      0      0   9.0000        S  Third
879         1       1  female  56.0      0      1  83.1583        C  First
881         0       3    male  33.0      0      0   7.8958        S  Third
885         0       3  female  39.0      0      5  29.1250        Q  Third
890         0       3    male  32.0      0      0   7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
6      man        True    E  Southampton    no   True
11   woman       False    C  Southampton   yes   True
..     ...         ...  ...          ...   ...    ...
873    man        True  NaN  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
881    man        True  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
890    man        True  NaN   Queenstown    no   True

[305 rows x 15 columns]